In [1]:
import pandas as pd
import numpy as np

# Basics

In [2]:
dates = pd.date_range('1/1/2000', periods=8)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01 -1.258637 -0.765479  0.815993 -1.649816
2000-01-02  0.221590 -0.944064  1.658558 -0.167973
2000-01-03 -1.317218 -0.818619 -0.217078 -2.108027
2000-01-04 -2.213060  0.474268  0.529014  0.432965
2000-01-05  0.063744 -0.243586  0.396990 -0.125481
2000-01-06  1.458709  0.764446  0.094014 -0.072833
2000-01-07 -1.009383 -0.162299  0.193973 -0.407869
2000-01-08  0.183535 -0.798037  0.636183 -0.198728

In [4]:
s = df['A']
s[dates[0]]

-1.258637254312775

In [5]:
df.loc[:, ['B', 'A']] = df[['A', 'B']].to_numpy()
df[['A', 'B']]

                   A         B
2000-01-01 -0.765479 -1.258637
2000-01-02 -0.944064  0.221590
2000-01-03 -0.818619 -1.317218
2000-01-04  0.474268 -2.213060
2000-01-05 -0.243586  0.063744
2000-01-06  0.764446  1.458709
2000-01-07 -0.162299 -1.009383
2000-01-08 -0.798037  0.183535

# Attribute access

In [6]:
sa = pd.Series([1, 2, 3], index=list('abc'))
sa

a    1
b    2
c    3
dtype: int64

In [7]:
dfa = df.copy()

In [8]:
sa.b

2

In [9]:
dfa.A

2000-01-01   -0.765479
2000-01-02   -0.944064
2000-01-03   -0.818619
2000-01-04    0.474268
2000-01-05   -0.243586
2000-01-06    0.764446
2000-01-07   -0.162299
2000-01-08   -0.798037
Freq: D, Name: A, dtype: float64

In [10]:
sa.a = 4

In [11]:
sa

a    4
b    2
c    3
dtype: int64

In [12]:
dfa.A = list(range(len(dfa.index)))

In [13]:
dfa

            A         B         C         D
2000-01-01  0 -1.258637  0.815993 -1.649816
2000-01-02  1  0.221590  1.658558 -0.167973
2000-01-03  2 -1.317218 -0.217078 -2.108027
2000-01-04  3 -2.213060  0.529014  0.432965
2000-01-05  4  0.063744  0.396990 -0.125481
2000-01-06  5  1.458709  0.094014 -0.072833
2000-01-07  6 -1.009383  0.193973 -0.407869
2000-01-08  7  0.183535  0.636183 -0.198728

In [14]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [15]:
x.iloc[1]

x    2
y    4
Name: 1, dtype: int64

In [16]:
x.iloc[1, 1]

4

In [17]:
x.iloc[1] = {'x': 9, 'y': 99}

In [18]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [19]:
df_new = pd.DataFrame({'one': [1., 2., 3.]})
df_new.two = [4, 5, 6]
df_new

C:\Users\ax25250\AppData\Local\Temp\ipykernel_18288\4293711910.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df_new.two = [4, 5, 6]

   one
0  1.0
1  2.0
2  3.0

In [20]:
df_new['two'] = [4, 5, 6]

In [21]:
df_new

   one  two
0  1.0    4
1  2.0    5
2  3.0    6

# Slicing ranges

In [22]:
s

2000-01-01   -0.765479
2000-01-02   -0.944064
2000-01-03   -0.818619
2000-01-04    0.474268
2000-01-05   -0.243586
2000-01-06    0.764446
2000-01-07   -0.162299
2000-01-08   -0.798037
Freq: D, Name: A, dtype: float64

In [23]:
s[:5]

2000-01-01   -0.765479
2000-01-02   -0.944064
2000-01-03   -0.818619
2000-01-04    0.474268
2000-01-05   -0.243586
Freq: D, Name: A, dtype: float64

In [24]:
s[::2]

2000-01-01   -0.765479
2000-01-03   -0.818619
2000-01-05   -0.243586
2000-01-07   -0.162299
Freq: 2D, Name: A, dtype: float64

In [25]:
s2 = s.copy()
s2[:5] = 2
s2

2000-01-01    2.000000
2000-01-02    2.000000
2000-01-03    2.000000
2000-01-04    2.000000
2000-01-05    2.000000
2000-01-06    0.764446
2000-01-07   -0.162299
2000-01-08   -0.798037
Freq: D, Name: A, dtype: float64

In [26]:
df[:4]

                   A         B         C         D
2000-01-01 -0.765479 -1.258637  0.815993 -1.649816
2000-01-02 -0.944064  0.221590  1.658558 -0.167973
2000-01-03 -0.818619 -1.317218 -0.217078 -2.108027
2000-01-04  0.474268 -2.213060  0.529014  0.432965

In [27]:
df[:-1]

                   A         B         C         D
2000-01-01 -0.765479 -1.258637  0.815993 -1.649816
2000-01-02 -0.944064  0.221590  1.658558 -0.167973
2000-01-03 -0.818619 -1.317218 -0.217078 -2.108027
2000-01-04  0.474268 -2.213060  0.529014  0.432965
2000-01-05 -0.243586  0.063744  0.396990 -0.125481
2000-01-06  0.764446  1.458709  0.094014 -0.072833
2000-01-07 -0.162299 -1.009383  0.193973 -0.407869

In [28]:
df[2:4]

                   A         B         C         D
2000-01-03 -0.818619 -1.317218 -0.217078 -2.108027
2000-01-04  0.474268 -2.213060  0.529014  0.432965

In [29]:
s1 = pd.Series(np.random.randn(6), index=list('abcdef'))
s1

a   -0.651941
b    0.097553
c    0.053667
d   -1.103256
e    0.174370
f   -1.227464
dtype: float64

In [30]:
list('abcdef')

['a', 'b', 'c', 'd', 'e', 'f']

In [31]:
s1['c':]

c    0.053667
d   -1.103256
e    0.174370
f   -1.227464
dtype: float64

In [32]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list('abcdef'),
                   columns=list('ABCD'))

In [33]:
df1

          A         B         C         D
a -1.411040  0.200417  0.340901 -0.137170
b -1.058986  1.062294  0.073736  0.878644
c -1.401815 -0.729934 -0.576786 -1.524891
d -1.122102  0.152588 -1.211871 -0.783565
e  0.151996 -1.071256  2.181815  0.727957
f -0.679496  0.194257  2.435356 -0.642112

In [34]:
df1.loc[['a', 'd'], :]

          A         B         C         D
a -1.411040  0.200417  0.340901 -0.137170
d -1.122102  0.152588 -1.211871 -0.783565

In [35]:
df1.loc['d', 'B':'C']

B    0.152588
C   -1.211871
Name: d, dtype: float64

In [36]:
df1.loc[:, df1.loc['a'] > 0]

          B         C
a  0.200417  0.340901
b  1.062294  0.073736
c -0.729934 -0.576786
d  0.152588 -1.211871
e -1.071256  2.181815
f  0.194257  2.435356

In [37]:
mask = pd.array([True, False, True, False, pd.NA, False], dtype="boolean")

In [38]:
mask[4]

In [39]:
df1[mask]

          A         B         C         D
a -1.411040  0.200417  0.340901 -0.137170
c -1.401815 -0.729934 -0.576786 -1.524891

In [40]:
mask[4] = True
df1[mask]

          A         B         C         D
a -1.411040  0.200417  0.340901 -0.137170
c -1.401815 -0.729934 -0.576786 -1.524891
e  0.151996 -1.071256  2.181815  0.727957

# Slicing with labels

In [41]:
s = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])
s

0    a
3    b
2    c
5    d
4    e
dtype: object

In [42]:
s.sort_index(ascending=False)

5    d
4    e
3    b
2    c
0    a
dtype: object

# Selection by position

In [43]:
s1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))
s1

0   -0.872888
2   -0.183519
4   -0.793255
6    0.026422
8   -0.392604
dtype: float64

In [44]:
s1.iloc[:3]

0   -0.872888
2   -0.183519
4   -0.793255
dtype: float64

In [45]:
s1.iloc[1]

-0.1835187942083303

In [46]:
s1.iloc[:4] = 0

In [47]:
s1

0    0.000000
2    0.000000
4    0.000000
6    0.000000
8   -0.392604
dtype: float64

In [48]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list(range(0, 12, 2)),
                   columns=list(range(0, 8, 2)))

In [49]:
df1

           0         2         4         6
0  -2.252658 -0.043169  0.156729 -0.064237
2   0.113639 -0.310421  2.005873 -0.526666
4  -0.817409  1.092487  0.269629 -0.129303
6  -0.310062 -0.583295  2.143583 -0.024573
8  -1.199573 -0.114648 -0.828533 -0.846269
10 -0.084784  0.285308  0.684573 -0.299275

In [50]:
df1.iloc[1:5, 2:4]

          4         6
2  2.005873 -0.526666
4  0.269629 -0.129303
6  2.143583 -0.024573
8 -0.828533 -0.846269

In [51]:
df1.iloc[[1, 3, 5], [1, 3]]

           2         6
2  -0.310421 -0.526666
6  -0.583295 -0.024573
10  0.285308 -0.299275

# Selection by callable

In [52]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list('abcdef'),
                   columns=list('ABCD'))

In [53]:
df1

          A         B         C         D
a  1.665384  0.953384  1.535617  0.132669
b  1.085869  1.771658  0.583792 -0.985601
c -0.149073 -0.146930 -2.424727  0.384528
d  1.358206  0.133193 -0.158354 -0.424552
e -0.257430  1.628299 -1.804277  0.492786
f  1.097457  2.477245 -0.592662 -0.033354

In [55]:
df.loc[lambda df:df['A'] > 0, :]

                   A         B         C         D
2000-01-04  0.474268 -2.213060  0.529014  0.432965
2000-01-06  0.764446  1.458709  0.094014 -0.072833

In [56]:
df.loc[df['A'] > 0, :]

                   A         B         C         D
2000-01-04  0.474268 -2.213060  0.529014  0.432965
2000-01-06  0.764446  1.458709  0.094014 -0.072833

# Selecting random samples

In [57]:
s = pd.Series([0, 1, 2, 3, 4, 5])

In [58]:
s

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [60]:
s.sample()

3    3
dtype: int64

In [61]:
s.sample(3)

1    1
0    0
4    4
dtype: int64

In [63]:
s.sample(frac=0.5)

5    5
0    0
2    2
dtype: int64

In [64]:
example_weights = [0, 0, 0.2, 0.2, 0.2, 0.4]
s.sample(n=3, weights=example_weights)

4    4
5    5
3    3
dtype: int64

In [65]:
s.sample(n=3, weights=example_weights)

5    5
2    2
4    4
dtype: int64

In [66]:
s.sample(n=3, weights=example_weights)

5    5
4    4
2    2
dtype: int64

In [67]:
df2 = pd.DataFrame({'col1': [9, 8, 7, 6],
                    'weight_column': [0.5, 0.4, 0.1, 0]})
df2.sample(n=3, weights='weight_column')

   col1  weight_column
1     8            0.4
0     9            0.5
2     7            0.1

# The where() Method and Masking

In [68]:
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [69]:
s[s > 0]

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [70]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])
df[df < 0]

                   A         B         C         D
2000-01-01 -1.575442 -1.187877 -1.282280       NaN
2000-01-02 -0.226531       NaN       NaN       NaN
2000-01-03       NaN       NaN       NaN       NaN
2000-01-04 -1.098782       NaN       NaN       NaN
2000-01-05       NaN       NaN -1.711625       NaN
2000-01-06       NaN -1.004532       NaN       NaN
2000-01-07       NaN       NaN       NaN -0.629111
2000-01-08 -0.164068 -1.190833 -0.738510 -1.156963

# Mask

In [71]:
s.mask(s >= 0)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

In [73]:
s.mask(s <= 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [74]:
df.mask(df >= 0)

                   A         B         C         D
2000-01-01 -1.575442 -1.187877 -1.282280       NaN
2000-01-02 -0.226531       NaN       NaN       NaN
2000-01-03       NaN       NaN       NaN       NaN
2000-01-04 -1.098782       NaN       NaN       NaN
2000-01-05       NaN       NaN -1.711625       NaN
2000-01-06       NaN -1.004532       NaN       NaN
2000-01-07       NaN       NaN       NaN -0.629111
2000-01-08 -0.164068 -1.190833 -0.738510 -1.156963

# Setting with enlargement conditionally using numpy()

In [75]:
df = pd.DataFrame({'col1': list('ABBC'), 'col2': list('ZZXY')})
df

  col1 col2
0    A    Z
1    B    Z
2    B    X
3    C    Y

In [76]:
df['color'] = np.where(df['col2'] == 'Z', 'green', 'red')

In [77]:
df

  col1 col2  color
0    A    Z  green
1    B    Z  green
2    B    X    red
3    C    Y    red

In [79]:
df['new_color'] = np.where(df['color'].str.contains('red'), 'yellow', 'white')
df

  col1 col2  color new_color
0    A    Z  green     white
1    B    Z  green     white
2    B    X    red    yellow
3    C    Y    red    yellow

In [81]:
conditions = [
    (df['col2'] == 'Z') & (df['col1'] == 'A'),
    (df['col2'] == 'Z') & (df['col1'] == 'B'),
    (df['col1'] == 'B')]

In [82]:
choices = ['yellow', 'blue', 'purple']

In [83]:
df['color'] = np.select(conditions, choices, default='black')
df

  col1 col2   color new_color
0    A    Z  yellow     white
1    B    Z    blue     white
2    B    X  purple    yellow
3    C    Y   black    yellow

# The query() Method

In [84]:
n = 10
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))
df

          a         b         c
0  0.716306  0.221493  0.951123
1  0.934475  0.079990  0.695350
2  0.832743  0.531360  0.045456
3  0.151316  0.920172  0.697990
4  0.662558  0.902742  0.430802
5  0.145972  0.239324  0.539131
6  0.144854  0.994270  0.911877
7  0.434030  0.575797  0.677958
8  0.767756  0.881709  0.688119
9  0.590464  0.859735  0.043250

In [85]:
df[(df['a'] < df['b']) & (df['b'] < df['c'])]

          a         b         c
5  0.145972  0.239324  0.539131
7  0.434030  0.575797  0.677958

In [86]:
df.query('(a < b) & (b < c)')

          a         b         c
5  0.145972  0.239324  0.539131
7  0.434030  0.575797  0.677958

In [87]:
df = pd.DataFrame(np.random.randint(n, size=(n, 3)), columns=list('abc'))

In [88]:
df

   a  b  c
0  3  1  8
1  3  9  2
2  8  2  1
3  7  6  7
4  3  8  7
5  1  8  5
6  8  6  5
7  1  8  7
8  5  0  5
9  6  2  5

In [90]:
df.query('a > b & b < c')

   a  b  c
0  3  1  8
3  7  6  7
8  5  0  5
9  6  2  5

In [91]:
df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc'),
                   'c': np.random.randint(5, size=12),
                   'd': np.random.randint(9, size=12)})

In [92]:
df

    a  b  c  d
0   a  a  2  8
1   a  a  1  4
2   b  a  3  5
3   b  a  3  2
4   c  b  0  8
5   c  b  4  0
6   d  b  2  2
7   d  b  3  5
8   e  c  0  4
9   e  c  1  5
10  f  c  0  5
11  f  c  0  8

In [93]:
df.query('a in b')

   a  b  c  d
0  a  a  2  8
1  a  a  1  4
2  b  a  3  5
3  b  a  3  2
4  c  b  0  8
5  c  b  4  0

In [94]:
df[df['a'].isin(df['b'])]

   a  b  c  d
0  a  a  2  8
1  a  a  1  4
2  b  a  3  5
3  b  a  3  2
4  c  b  0  8
5  c  b  4  0

In [95]:
df.query('a not in b')

    a  b  c  d
6   d  b  2  2
7   d  b  3  5
8   e  c  0  4
9   e  c  1  5
10  f  c  0  5
11  f  c  0  8

In [96]:
df.query('b == ["a", "b", "c"]')

    a  b  c  d
0   a  a  2  8
1   a  a  1  4
2   b  a  3  5
3   b  a  3  2
4   c  b  0  8
5   c  b  4  0
6   d  b  2  2
7   d  b  3  5
8   e  c  0  4
9   e  c  1  5
10  f  c  0  5
11  f  c  0  8

In [97]:
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

In [98]:
df

          a         b         c
0  0.921851  0.604228  0.946637
1  0.674133  0.970074  0.582867
2  0.117123  0.741646  0.364208
3  0.758140  0.369408  0.400236
4  0.707257  0.524261  0.920000
5  0.133510  0.580993  0.477608
6  0.304443  0.907001  0.717228
7  0.500861  0.877235  0.273967
8  0.996376  0.277461  0.816433
9  0.801540  0.492059  0.320390

In [99]:
df['bools'] = np.random.rand(len(df)) > 0.5
df

          a         b         c  bools
0  0.921851  0.604228  0.946637   True
1  0.674133  0.970074  0.582867   True
2  0.117123  0.741646  0.364208   True
3  0.758140  0.369408  0.400236   True
4  0.707257  0.524261  0.920000   True
5  0.133510  0.580993  0.477608   True
6  0.304443  0.907001  0.717228  False
7  0.500861  0.877235  0.273967   True
8  0.996376  0.277461  0.816433   True
9  0.801540  0.492059  0.320390   True

In [100]:
df.query('~bools')

          a         b         c  bools
6  0.304443  0.907001  0.717228  False

In [101]:
df.query('bools')

          a         b         c  bools
0  0.921851  0.604228  0.946637   True
1  0.674133  0.970074  0.582867   True
2  0.117123  0.741646  0.364208   True
3  0.758140  0.369408  0.400236   True
4  0.707257  0.524261  0.920000   True
5  0.133510  0.580993  0.477608   True
7  0.500861  0.877235  0.273967   True
8  0.996376  0.277461  0.816433   True
9  0.801540  0.492059  0.320390   True